[
  {
    "id": "supply-chain-management",
    "title": "Supply Chain Management System",
    "description": "Developed a Supply Chain Management System using Node.Js, mySql and React.",
    "github_link": "https://github.com/vihanga02/supply-chain-management.git"
  },
  {
    "id": "spirit11",
    "title": "Spirit11 Group Project",
    "description": "Developed fantasy cricket experience where users can draft real university players, analyze statistics, and compete on the leaderboard using Next.Js, Mongodb and FastApi.",
    "github_link": "https://github.com/vihanga02/spirit11.git"
  },
  {
    "id": "holiday-life",
    "title": "Holiday Life - Travel Website",
    "description": "Developed Business to Consumer travel website for lushWare-Org using React and MongoDB.",
    "github_link": "https://github.com/vihanga02/holiday-life.git"
  },
  {
    "id": "furniture-seller",
    "title": "Furniture Seller",
    "description": "Developed a Mobile app for selling Furnitures using Express, MongoDB and React-Native",
    "github_link": "https://github.com/vihanga02/furniture-seller.git"
  },
  {
    "id": "nano-processor",
    "title": "Nano Processor",
    "description": "The assigned lab task is to design and develop a 4-bit nanoprocessor capable of executing 4 instructions. This includes several components that need to be developed or extended from the previous labs and this is a group project for Computer Organization and Digital Design module for semester 2. We used Vivado to all the coding and simulation works.",
    "github_link": "https://github.com/vihanga02/Nano-Processor.git"
  },
  {
    "id": "pos-system",
    "title": "POS System",
    "description": "Developed a program to manage an online shopping system. The shopkeepers can login to the system and add new items and edit current items which are available in the shop. Customers can login to the system and track their current shopping cart. Backend is developed by Java and GUI is developed using JavaFX",
    "github_link": "https://github.com/vihanga02/Grocery_shop_System.git"
  }
]
  